import {
  HiOutlineBriefcase,
  HiOutlineCalculator,
  HiOutlineCheckBadge,
  HiOutlineClipboardDocumentCheck,
  HiOutlineClock,
  HiOutlineCloudArrowDown,
  HiOutlineCog8Tooth,
  HiOutlineCubeTransparent,
  HiOutlineExclamationTriangle,
  HiOutlineFolderOpen,
  HiOutlineGift,
  HiOutlineIdentification,
  HiOutlineLink,
  HiOutlineLockClosed,
  HiOutlinePaperClip,
  HiOutlinePresentationChartBar,
  HiOutlineRectangleGroup,
  HiOutlineRectangleStack,
  HiOutlineShieldCheck,
  HiOutlineSparkles,
  HiOutlineUserPlus,
  HiOutlineUsers,
} from "react-icons/hi2";
import { NavLink } from "react-router-dom";
import styled from "styled-components";

const NavList = styled.ul`
  display: flex;
  flex-direction: column;
  gap: 0.8rem;
`;
const StyledNavLink = styled(NavLink)`
  &:link,
  &:visited {
    display: flex;
    align-items: center;
    gap: 1.2rem;

    color: var(--color-gray-600);
    font-size: 1.6rem;
    font-weight: 500;
    padding: 0.6rem 2.4rem;
    transition: all 0.3s;
  }

  /* This works because react-router places the active class on the active NavLink */
  &:hover,
  &:active,
  &.active:link,
  &.active:visited {
    color: var(--color-gray-800);
    background-color: var(--color-gray-50);
    border-radius: var(--border-radius-sm);
  }

  & svg {
    width: 2.4rem;
    height: 2.4rem;
    color: var(--color-gray-400);
    transition: all 0.3s;
  }

  &:hover svg,
  &:active svg,
  &.active:link svg,
  &.active:visited svg {
    color: var(--color-yellow-600);
  }
`;
const DividerWithText = styled.div`
  font-size: 1.2rem;
  display: flex;
  align-items: center;
  text-align: center;
  margin: 1.2rem 0;
  color: var(--color-yellow-700);
  opacity: 0.7;

  &::before,
  &::after {
    content: "";
    flex: 1;
    border-top: 1px solid var(--color-gray-100);
  }

  &::before {
    margin-right: 0.75em;
  }

  &::after {
    margin-left: 0.75em;
  }
`;

function MainNav() {
  return (
    <nav>
      <DividerWithText>Organization</DividerWithText>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineRectangleGroup />
            <span>โครงสร้างองค์กร</span>
            {/* โครงสร้างองค์กร
สามารถสร้างโครงสร้างองค์กรได้ สูงสุด 5 ขั้น ของแต่ละสำนักงานสาขา ตามโครงสร้างองค์กรของแต่ละบริษัท

 */}

            {/* โครงสร้างตำแหน่ง
โครงสร้างตำแหน่ง สามารถสร้างตำแหน่งหน่วยงานย่อย ได้สูงสุด 20 ขั้น ตามโครงสร้างตำแหน่งของแต่ละบริษัท */}

            {/* ข้อมูลทีมงาน
เป็นการสร้างทีมในการทำงาน เพื่อนำไปใช้ประกอบกับการมอบหมายงานให้แต่ละทีมที่ To-do List */}

            {/* ข้อมูลหน่วยธุรกิจ
เป็นการสร้างหน่วยธุรกิจในการทำงาน ว่าในแต่ละหน่วยธุรกิจต้องมี job ในการทำงานในหน่วยธุรกิจอะไรบ้าง ช่วง Time Frame ในการทำงานมีอะไรบ้าง หน่วยธุรกิจประกอบไปด้วย

Job Master เป็นการสร้างข้อมูล Job ในการทำงาน ว่าแต่ละ Job ในการทำงานต้องมีพนักงานน้อยที่สุด และมากที่สุดในการทำ Job นี้เท่าไร
Time Frame เป็นการสร้างกลุ่มกะการทำงานให้เหมาะสมกับหน่วยธุรกิจ โดย 1 Time Frame มีได้หลากหลายกะการทำงาน
Employee With Job เป็นการเลือก Job ให้กับพนักงานว่าพนักงานสามารถทำงาน Job อะไรได้บ้าง เพื่อนำไปจัดการ การวางแผน
Business Unit เป็นการสร้างโครงการ ของการทำงานในแต่ละหน่วยธุรกิจ ว่า 1 หน่วยธุรกิจต้องประกอบไปด้วย Job Master และ Time Frame อะไรบ้าง */}

            {/* นโยบายบริษัท
เมนูนโยบายบริษัทใช้สำหรับการประกาศนโยบายในองค์กรโดยจะไปแสดงผลบน Application และ Web สำหรับพนักงาน การเพิ่มนโยบาย สามารถแนบได้ทั้งไฟล์รูปภาพ และไฟล์เอกสาร */}

            {/*  ข้อมูลผู้ติดต่อภายใน
ข้อมูลผู้ติดต่อภายใน เป็นข้อมูลการติดต่อของพนักงานภายในองค์กร สามารถขอดูข้อมูลการติดต่อได้คือ ชื่อ-นามสกุล ตำแหน่ง อีเมล และเบอร์โทร*/}

            {/* ปรับโครงสร้างองค์กร/ตำแหน่ง
การปรับโครงสร้างองค์กร/ตำแหน่ง เมื่อมีนโยบายในการปรับโครงสร้างองค์กร/ตำแหน่งในบริษัท สามารถจัดการปรับโครงสร้างองค์กร/ตำแหน่งของพนักงานไว้ล่วงหน้าได้ เพื่อเก็บข้อมูลการปรับโครงสร้างภายในบริษัท หรือสามารถปรับโครงสร้างองค์กรภายในเดือนที่ต้องการปรับโครงสร้างได้เลย */}

            {/* เส้นทางการเติบโตในตำแหน่ง
พนักงานสามารถดูเส้นทางการเติมโตในตำแหน่งของตนเองได้ แต่จะสามารถดูได้เฉพาะในสายงานของตนเองเท่านั้น พนักงานจะดูได้ผ่านทาง Mobile Application */}

            {/* Organization Chart
ผังองค์กร (Organizational Chart) เป็นกราฟแสดงโครงสร้างและความสัมพันธ์ระหว่างตำแหน่งงานและบุคคลภายในองค์กร ผังองค์กรช่วยให้คนที่ทำงานในองค์กรเข้าใจโครงสร้างและความเชื่อมโยงในการทำงาน */}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineIdentification />
            <span>ข้อมูลพนักงาน</span>
            {/* ข้อมูลส่วนตัว
ข้อมูลส่วนตัวของพนักงาน ประกอบไปด้วย ชื่อ-นามสกุล เลขบัตรประจำตัวประชาชน สัญชาติ วันเดือนปีเกิด เบอร์โทร อีเมล เป็นต้น สามารถแก้ไขข้อมูลพนักงานทั้งหมด หรือสามารถเลือกแก้ไขแยกตามสาขาแต่ละแผนก หรือทำการแก้ไขทั้งหมด และพนักงานสามารถแก้ไขข้อมูลส่วนตัวของตนเองได้ผ่านทาง Mobile Application และ Web Browser */}
            {/*ข้อมูลเงินเดือน
ข้อมูลเงินเดือน เป็นการเพิ่ม/แก้ไข ข้อมูลในส่วนของเงินเดือนของพนักงานทั้งหมด โดยสามารถเลือกแก้ไขแยกตามสาขาและแผนก หรือทำการแก้ไขทั้งหมด  */}
            {/*ข้อมูลที่อยู่
การกรอกข้อมูลที่อยู่ของพนักงาน ทั้งตามบัตรประชาชน และที่อยู่ปัจจุบันของพนักงาน  */}
            {/*  ข้อมูลครอบครัว
เป็นการกรอกประวัติครอบครัวของพนักงานของพนักงานแต่ละท่าน เก็บไว้ในนระบบ HumanSoft*/}
            {/*ข้อมูลประวัติการทำงาน
เป็นการกรอกประวัติการทำงานที่เคยผ่านมาของพนักงานแต่ละท่าน เก็บไว้ในนระบบ HumanSoft  */}
            {/* ข้อมูลประวัติการศึกษา
เป็นการกรอกประวัติข้อมูลการศึกษาของพนักงานแต่ละท่าน เก็บไว้ในนระบบ HumanSoft */}
            {/* ข้อมูลความสามารถพิเศษ
เป็นการกรอกประวัติข้อมูลความสามารถพิเศษของพนักงานแต่ละท่าน เก็บไว้ในนระบบ HumanSoft */}
            {/* Tax deduction
กรอกข้อมูลค่าลดหย่อนภาษีของพนักงานแต่ละบุคคล พนักงานสามารถกรอกค่าลดหย่อนของตนเองได้ผ่านทาง Mobile Application และค่าลดหย่อนที่พนักงานกรอกมาจะถูกนำไปคำนวณลดหย่อนภาษีให้กับพนักงานในแต่ละเดือน */}

            {/* ข้อมูลโรงพยาบาลที่มีสิทธิ์
การเก็บข้อมูลโรงพยาบาลที่พนักงานมีสิทธิ์ในการรักษา */}

            {/* ข้อมูลเงินประกันการทำงาน
เงินประกันการทำงาน เป็นการนำข้อมูลเงินประกันพนักงานเข้าระบบ เก็บเป็นข้อมูลประวัติเงินประกันการทำงานที่พนักงานเคยชำระไปแล้ว แต่ถ้าต้องการให้ระบบหักเงินประกันการทำงานให้กับพนักงานเป็นงวดๆ สามารถทำได้ที่เมนู การประมวลผลเงินเดือน > จัดการหนี้สินพนักงาน */}

            {/* ข้อมูลกองทุน
กองทุน สามารถกรอกรายบุคคลหรือนำเข้าข้อมูลกองทุนก็ได้ กองทุนสามารถกำหนด เลขที่กองทุน วันที่สัญญากองทุน วิธีการหักเงิน เรทกองทุน วิธีการสมทบ บริษัทสมทบ และผู้ได้รับผลประโยชน์ และเมื่อมีการกำหนดเรทการหักกองทุน ระบบจะหักกองทุนให้ตามเรทที่ได้กำหนดไว้

เลขที่กองทุน สามารถใส่เลขที่กองทุนเลขเดียวกันหรือคนละเลขที่กองทุนก็ได้
วันที่สัญญากองทุน สามารถกำหนดหรือแก้ไขวันที่เริ่มสัญญากองทุน
วิธีการหักเงิน สามารถเลือกวิธีการหักเงินได้ทั้งหมด 3 รูปแบบ คือ คิดเป็น % , คิดเป็นบาท และคิดตามสูตร(ติดต่อเจ้าหน้าที่เท่านั้น)
เรทกองทุน กรอกจำนวนที่ต้องการให้ระบบหักกองทุน
วิธีการสมทบ สามารถเลือกวิธีการหักเงินได้ทั้งหมด 3 รูปแบบ คือ คิดเป็น % , คิดเป็นบาท และคิดตามสูตร(ติดต่อเจ้าหน้าที่เท่านั้น)
บริษัทสมทบ กรอกจำนวนที่ต้องการให้ระบบหักกองทุน
ยอดสะสม ถ้าพนักงานเคยถูกหักกองทุนมาก่อนหน้านี้ สามารถเข้ามากรอกยอดสะสมได้ที่ เพื่อใส่มูลค่าในเดือนที่ผ่านมาแล้ว */}

            {/* ข้อมูลการฝึกอบรม
สามารถบันทึกข้อมูลการอบรมของพนักงานได้ ว่าพนักงานเคยเผยการอบรมอะไรมาแล้วบ้าง การฝึกอบรมแจ้งกรมพัฒนาแรงงานหรือไม่ */}

            {/* ข้อมูลการสินทรัพย์ถือครอง
สามารถบันทึกข้อมูลสินทรัพย์ถือครองของพนักงานรายบุคคลได้ ว่าพนักงานมีสินทรัพย์ถือครองของบริษัทอะไรบ้าง */}

            {/* ข้อมูลใบหน้า
การลงเวลาการทำงานสามารถลงเวลาการทำงานด้วยการสแกนใบหน้า จึงต้องมีข้อมูลใบหน้าที่ข้อมูลพนักงาน เพื่อเก็บข้อมูลในการลงเวลาการทำงาน */}

            {/*กำหนดผู้อนุมัติเอกสาร 5 ขั้น
สามารถกำหนดผู้อนุมัติเอกสารได้ สูงสุด 5 ขั้น เอกสารที่สามารถกำหนดผู้อนุมัติเอกสารได้ มี 5 เอกสาร ได้แก่ เอกสารลางาน เอกสารเพิ่มเวลา เอกสารโอที เอกสารเปลี่ยนกะการทำงาน และเอกสารเปลี่ยนวันหยุด ผู้อนุมัติสามารถอนุมัติเอกสารได้ผ่านทาง Mobile Application และ WebBeowes  */}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineCheckBadge />
            <span>ประเมินพนักงาน</span>
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlinePresentationChartBar />
            <span>รายงานวิเคราะห์ข้อมูล</span>
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineShieldCheck />
            <span>การอนุญาต</span>
            {/* ข้อมูลผู้ใช้
การกำหนดข้อมูลผู้ใช้ (User provisioning) เป็นกระบวนการที่ใช้เพื่อสร้างและลบข้อมูลผู้ใช้ในระบบ Web หรือแอปพลิเคชัน จะถูกทำอัตโนมัติเมื่อมีการเพิ่มผู้ใช้ใหม่ */}
            {/* ข้อมูลกลุ่มผู้ใช้
การกำหนดกลุ่มผู้ใช้งานในการเข้าใช้งานระบบ HumanSoft ระบบ HumanSoft มีกลุ่มการเข้าใช้งานระบบ 7 สิทธิ์ ได้แก่

AUDIT (ตรวจสอบเวลาการทำงาน)
EMPLOYEE (พนักงานทั่วไป)
HRBU (เจ้าหน้าที่ตรวจสอบเวลา)
MANAGER (ผู้จัดการ)
SAL (เจ้าหน้าที่เงินเดือน)
SALBU (ผู้ช่วยเจ้าหน้าที่เงินเดือน)
SALINEX (เจ้าหน้าที่จัดการรายรับรายจ่าย) */}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineLockClosed />
            <span>ความปลอดภัย</span>
            {/* Strong Password
เป็นการตั้งค่า password ในการเข้าใช้งานให้มีความยากมากยิ่งขึ้น เพื่อเพิ่มความปลอดภัยในการใช้งานของผู้ใช้งานระบบ การตั้งค่ารหัสผ่านต้องมีความยาว 8 หลัก ประกอบไปด้วย

ตัวอักษรภาษาอังกฤษพิมพ์ใหญ่
ตัวอักษรภาษาอังกฤษพิมพ์เล็ก
ตัวเลข
เครื่องหมายหรืออักขระพิเศษผสมกัน
เมื่อเปิดใช้แล้วจะมีผลต่อเมื่อพนักงานกดเปลี่ยนรหัสผ่าน หรือพนักงานใหม่เข้าใช้งานครั้งแรก ตัวอย่างเช่น A@b12345 */}
            {/* PDPA Conceal
การยินยอมเปิดเผยนโยบายความเป็นส่วนตัวของเจ้าของข้อมูลกับระบบ HumanSoft เพื่อให้ผู้ใช้งานสามารถใช้งานระบบ HumanSoft ได้ จำเป็นที่จะต้องยินยอมในการเปิดเผยข้อมูล หากไม่ยินยอม ผู้ใช้งานจะไม่สามารถใช้งานระบบ HumanSoft ได้ */}
          </StyledNavLink>
        </li>
      </NavList>
      <DividerWithText>Employment</DividerWithText>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineUserPlus />
            <span>สมัครพนักงาน</span>
            {/*ใบสมัครงานออนไลน์
HR สามารถสร้างประกาศรับสมัครงานออนไลน์ได้ผ่านระบบ HumanSoft และนำลิงก์การประกาศไปแชร์ผ่านทาง แพลตฟอร์มด้านนอกได้ และผู้สมัครจะกรอกข้อมูลสมัครงานได้ผ่านทางระบบ HumanSoft ได้เลย */}
            {/* ระบบรับสมัครพนักงาน
การรับสมัครงาน เป็นกระบวนการที่สามารถทำได้อย่างมีประสิทธิภาพและสะดวกสบายทั้งสำหรับผู้สมัคร หัวหน้างานและฝ่ายบุคคล ระบบรับสมัครงานของทาง HumanSoft มีขั้นตอนดังนี้

สัมภาษณ์งาน
ประเมินผู้สมัคร
เลือกผู้สมัคร
สั่งเข้าบริษัท
Blacklists ผู้สมัคร
ผู้สมัครทำแบบทดสอบ */}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineRectangleStack />
            <span>Onboarding</span>
            {/* ปฐมนิเทศ
กระบวนการหรือกิจกรรมที่ใช้เพื่อให้ความรู้และคำแนะนำเบื้องต้นแก่บุคคลใหม่ที่เข้าร่วมในองค์กรหรือองค์กรใหม่ โดยทั่วไปแล้ว กระบวนการนี้จะให้ข้อมูลเกี่ยวกับองค์กร เช่น วัฒนธรรมและค่านิยมขององค์กร โครงสร้างองค์กร นโยบายและกฎระเบียบ เป้าหมายและรายละเอียดของตำแหน่งงานนอกจากนี้ การแนะนำผู้เข้าร่วมใหม่กับเพื่อนร่วมงานและทีมงาน การติดต่อสื่อสารและการรับฟังเป็นส่วนสำคัญของการปฏิบัติงานด้วย ความสำเร็จของกระบวนการนี้ส่งผลให้ผู้เข้าร่วมใหม่มีความเข้าใจที่ดีเกี่ยวกับองค์กร และสามารถปรับตัวและทำงานอย่างมีประสิทธิภาพได้เร็วขึ้น */}
            {/*  ประเมินพนักงานทดลองงาน
การประเมินพนักงานทดลองงาน พนักงานที่ยังไม่มีวันที่บรรจุ จะถูกคิดว่าเป็นพนักงานทดลองงานอยู่เสมอ จนกว่าจะมีวันที่บรรจุ การประเมินพนักงานว่าผ่านทดลองงานหรือไม่ HR สามารถเลือกแบบประเมินที่ถูกสร้างไว้อยู่แล้ว มอบให้ผู้ประเมิน ประเมินพนักงานทดลองงานได้ผ่านทาง Mobile Application และ Web Browser*/}
          </StyledNavLink>
        </li>
      </NavList>
      <DividerWithText>Working hours</DividerWithText>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineUsers />
            <span>ทรัพยาการบุคคล</span>
            {/* ข้อมูลกะการทำงาน เป็นการสร้างกะการทำงาานให้ตรงกับเงื่อนไขการใช้งานขององค์กร ระบบ HumanSoft มีกะการทำงานอยู่ทั้งหมด 6 ประเภท

กำหนดเวลาเข้าออก ในวันเดียวกัน คือ เข้าออกงานตามเวลาที่กำหนด ในวันเดียวกัน
กำหนดเวลาเข้าออก ข้ามเที่ยงคืนของพรุ่งนี้ คือ เข้าออกงานตามเวลาที่กำหนด ข้ามเที่ยงคืนของพรุ่งนี้
กำหนดเวลาเข้าออก ข้ามเที่ยงคืนของเมื่อวาน คือ เข้าออกงานตามเวลาที่กำหนด ข้ามเที่ยงคืนของเมื่อวาน
กำหนดชั่วโมงการทำงานรวม คือ เข้าออกงานเมื่อไหร่ก็ได้ แต่ชั่วโมงต่อวันต้องได้ตามที่กำหนด
กำหนดกะการทำงานโดยไม่ต้องลงเวลา คือ เข้าออกงานตามเวลาที่กำหนด ซึ่งจะไม่จำเป็นต้องลงเวลาการทำงาน
กำหนดควบกะการทำงาน คือ ใน 1 วันทำงาน สามารถมีได้มากกว่า 1 กะการทำงาน
และแต่ละกะการทำงานงานสามารถตั้งค่า มูลค่ากะการทำงานได้ ประเภทมูลค่ากะการทำงาน มีทั้งหมด 4 ประเภท คือ

คำนวณตามเงินเดือน คือ เมื่อพนักงานทำงานกะนี้จะได้ค่าแรง ตามค่าแรงรายวัน
กำหนดมูลค่าของกะการทำงานนี้ คือ เมื่อพนักงานทำงานกะนี้ จะได้ค่าตามมูลค่ากะ ที่กำหมดไว้
บวกมูลค่าเพิ่มสำหรับกะการทำงานนี้ คือ เมื่อพนักงานมาทำงานกะนี้ จะได้ ค่าแรง = ค่าแรงรายวัน + มูลค่ากะ
บวกจำนวนเท่าของค่าแรงเพิ่มสำหรับกะการทำงานนี้ คือ เมื่อพนักงานมาทำงานกะนี้ จะได้บวกมูลกะกาการทำงานเพิ่ม ตามจำนวนเท่าของค่าแรงที่กำหนด */}
            {/*  ข้อมูลวันหยุด
ข้อมูลวันหยุด พนักงานจะต้องมีข้อมูลวันทำงาน หรือวันหยุด ต่อ 1 สัปดาห์ ของพนักงาน ซึ่งทาง HR จะเป็นผู้จัดการวางแผนให้กับพนักงานตามเงื่อนไขการใช้งานของแต่ละองค์กรตามความเหมาะสม*/}
            {/* ข้อมูลวันทำงานพิเศษ
ข้อมูลการทำงานพิเศษ HR สามารถกำหนดไว้ทำงานพิเศษให้กับพนักงานได้ และตั้งค่าเงื่อนไขการให้ค่าแรงในการมาทำงานในวันทำงานพิเศษได้ด้วย เช่น พนักงานประจำ มาทำงานพิเศษในวันที่ 01/01/2023 จะได้รับค่าแรง 2 เท่าของค่าแรง โดยที่จะนำ ขาด ลา มาสาย มาคำนวณในค่าแรงด้วย และยังสามารถตั้งค่าได้ว่าจะนำค่าแรงในวันทำงานพิเศษไปคำนวณภาษี ประกันสังคม และกองทุนหรือไม่ */}
            {/*  จัดการกะการทำงาน-วันหยุด
จัดการกะการทำงาน-วันหยุด เป็นการจัดการวางแผนการทำงานให้กับพนักงาน โดย HR จะเป็นผู้จัดการวางแผนให้ HR สามารถจัดการวางแผนได้ที่ละหลายๆคน หรือจะว่างแผนให้กับพนักงานที่ละคนก็ได้ นอกจากจะวางแผนที่เมนูได้แล้ว ยังสามารถโหลดเทรมเพจออกมาจัดการข้างนอกและนำเข้าในระบบได้อีก HR สามารถวางแผนกะการทำงาน กะวันหยุด และวางกำลังพล ได้แยกออกจากกัน*/}
            {/* วางแผนกะการทำงาน-วันหยุด
เป็นการเพิ่มรอบการวางแผนการทำงานให้กับพนักงาน โดยพนักงานสามารถวางแผนกะการทำงานให้กับตนเองได้ HR จะเป็นผู้เพิ่มรอบให้ และพนักงานวางแผนให้กับตนเองได้ผ่านทาง Mobile Application */}
            {/* จัดการผังกำลังพล
จัดการผังกำลังพล เป็นการจัดการวางแผนกำลังพลในการทำงานของแต่ละหน่วยธุรกิจ ในหนึ่งหน่วยธุรกิจจะประกอบไปด้วยราย Job ที่ผูกกับพนักงานที่มีความสามารถในการทำงานในรายการ Job นี้ ช่วงเวลาการทำงาน Time Frame ในการทำงานของหน่วยธุรกิจนี้ โดยสามารถจัดการกำลังพลในการทำงานในหน่วยธุรกิจ ได้ตามความเหมาะสมของหน่วยธุรกิจ และระบบจำะคำนวณค่า Cost ของหน่วยธุรกิจนี้ออกมาให้ตามการจัดสรรขององค์กร */}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineClock />
            <span>ลงเวลางาน</span>
            {/*การลงเวลาการทำงาน ใช้สำหรับการลงเวลาการทำงานในรูปแบบต่าง ๆ เพื่อความสะดวกขอแต่ละบริษัท รวมทั้งยังสามารถให้หัวหน้างานสแกนใบหน้าพนักงาน เพื่อลงเวลาให้กับพนักงานได้ ซึ่งรูปแบบการลงเวลาแต่ละช่องทาง มีรายละเอียดดังนี้

ใบหน้า/แผนที่ คือ การลงเวลาด้วยใบหน้าหรือ หมุดGPS
สแกน QR Code คือ สแกน QR Code เพื่อลงเวลา
สร้าง QR Code (Time App) คือ การสร้าง QR Code ในแอปพลิเคชันของพนักงาน เพื่อลงเวลาผ่านเครื่องกลาง (HumanSoft Mobile Attendance) โดยการที่นำ QR Code ของเครื่องพนักงาน ไปให้เครื่องกลางสแกนเพื่อลงเวลา
Wi-Fi คือ ลงเวลาผ่านสัญญาน Wi-Fi
บีคอน คือ ลงเวลาผ่านสัญญาน Bluetooth
สแกนลูกทีม คือ การให้หัวหน้างานสแกนใบหน้าเพื่อลงเวลาแทน  */}
          </StyledNavLink>
        </li>
      </NavList>
      <DividerWithText>Document & Approval</DividerWithText>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineFolderOpen />
            <span>เอกสาร & การอนุมัติ</span>
            {/* ขอลางาน
พนักงานสามารถยื่นขอเอกสารลางานได้ด้วยตัวเองผ่านทาง Mobile Application และ Web Browser
HR สามารถตั้งค่าจำนวนวันในการลาล่วงหน้า และลาย้อนหลังของเอกสารลางานแต่ละฉบับได้ */}
            {/* ขอโอที
เอกสารโอที HR สามารถตั้งค่าการให้เงินในการทำโอที และกำหนดชั่วเวลาในการให้โอทีได้ ระบบ HumanSoft มีการ์ดโอทีให้อยู่ 8 การ์ด สามารถตั้งค่าได้ตามความเหมาะสมขององค์กร สำหรับพนักงาน สามารถยื่นขอเอกสารที่ทำโอทีได้ผ่านทาง Mobile Application และ Web Browser */}
            {/* ขอเพิ่มเวลา
เมื่อพนักงานลืมลงเวลาการทำงาน หรือทำงานนนอกสถานที่ สามารถเพิ่มเวลาเข้ามาในระบบได้ผ่านทาง Mobile Application และ Web Browser แต่เวลาจะไม่เข้าระบบจนกว่าเอกสารจะถูกอนุมัติจากหัวหน้างาน หรือ HR และ HR สามารถขอเอกสารแทนพนักงานได้ */}
            {/* ขอเปลี่ยนกะการทำงาน
หากพนักงานมีความต้องการที่จะเปลี่ยนกะการทำงาน พนักงานสามารถยื่นขอเอกสารเปลี่ยนกะการทำงานได้ผ่าน Mobile Application และ Web Browser แล้วหัวหน้างาน หรือ HR จะเป็นผู้อนุมัติเอกสารให้กับพนักงาน */}
            {/*  ขอเปลี่ยนวันหยุด
หากพนักงานมีความต้องการที่จะเปลี่ยนวันหยุดเป็นวันทำงาน หรือเปลี่ยนวันทำงานเป็นวันหยุด พนักงานสามารถยื่นขอเอกสารเปลี่ยนวันหยุดได้ผ่าน Mobile Application และ Web Browser แล้วหัวหน้างาน หรือ HR จะเป็นผู้อนุมัติเอกสารให้กับพนักงาน*/}
            {/*ขอเบิกล่วงหน้า
การขอเบิกเงินล่วงหน้า เป็นการยื่นขอเบิกเงินเดือนของพนักงานมาใช้ก่อน และจะมีการหักเงินเดือนออกตอนสิ้นรอบการคำนวณ HR สามารถกำหนดวงเงินในการขอเบิกล่วงหน้าของพนักงานแต่ละท่านได้ตามเงื่อนไขของบริษัท  */}
            {/*ขอเบิกเงินสดย่อย
เมนูสำหรับการขอเบิกเงินสดย่อยของพนักงาน โดยพนักงานสามารถขอเบิกเงินสดย่อยผ่าน Application โดยเพิ่มค่าใช้จ่ายต่าง ๆ ที่ต้องการเบิกและสามารถแนบไฟล์ เพื่อให้ทางผู้ดูแลสามารถกดตรวจสอบเอกสาร อนุมัติเอกสาร หรือจะขอเอกสารให้กับพนักงาน  */}
            {/* ขอเอกสารรับรองเงินเดือน
พนักงานสามารถยื่นขอเอกสารรับรองเงินเดือนของตนเองจากบริษัทได้ผ่านทาง Mobile Application และเลือกได้ว่าต้องการเอกสารรับรองเงินเดือนเป็นภาษาไทย หรือภาษาอังกฤษ */}
            {/* ขอเอกสารรับรองการทำงาน
พนักงานสามารถยื่นขอเอกสารรับรองการทำงานของตนเองจากบริษัทได้ผ่านทาง Mobile Application และเลือกได้ว่าต้องการเอกสารรับรองเงินเดือนเป็น ภาษาไทย หรือภาษาอังกฤษ */}
            {/* ขอสวัสดิการ
กระบวนการที่พนักงานต้องทำเพื่อขอรับสิทธิ์ หรือบริการสวัสดิการที่บริษัทหรือองค์กรมีให้ เป็นการติดต่อร้องขอจากพนักงานไปยังฝ่ายทรัพยากรบุคคล หรือฝ่ายที่เกี่ยวข้องเพื่อขอสิทธิ์ในสวัสดิการที่ต้องการ */}
            {/* ขอร้องเรียน
เมื่อพบปัญหาหรือการกระทำที่ไม่เหมาะสมจากบุคคลหรือองค์กรใด ๆ ซึ่งสามารถทำได้ในหลายทางที่ตามนโยบายของบริษัทหรือองค์กร การร้องเรียนมักจะต้องระบุปัญหาหรือเหตุการณ์ที่เกิดขึ้นอย่างชัดเจน และมีหลักฐานหรือข้อความที่เกี่ยวข้องเพื่อสนับสนุนการร้องเรียนของคุณ
การร้องเรียนมักจะถูกส่งไปยังฝ่ายที่เกี่ยวข้องเพื่อตรวจสอบ และดำเนินการแก้ไขปัญหาตามที่เห็นสมควร โดยบางบริษัทหรือองค์กรอาจมีกระบวนการเฉพาะในการร้องเรียนที่คุณต้องทำตาม การร้องเรียนเป็นสิทธิของคุณเพื่อให้ได้รับการแก้ไขปัญหา และสร้างการเปลี่ยนแปลงที่ดีต่อตนเองและองค์กร */}
            {/* เอกสารสัญญาจ้าง
เอกสารที่บรรจุเงื่อนไขและข้อตกลงที่กำหนดรายละเอียดเกี่ยวกับการจ้างงานระหว่างลูกจ้างกับนายจ้าง โดยทั่วไปแล้ว เอกสารสัญญาจ้างจะระบุสิ่งต่อไปนี้

รายละเอียดของลูกจ้างและนายจ้าง: เช่น ชื่อและที่อยู่ของลูกจ้างและนายจ้าง
ข้อกำหนดเรื่องตำแหน่งงาน: ระบุตำแหน่งงานที่ลูกจ้างจะทำงาน รวมถึงรายละเอียดเกี่ยวกับหน้าที่และความรับผิดชอบ
ระยะเวลาของการจ้าง: ระบุระยะเวลาที่ลูกจ้างจะทำงานในตำแหน่งนี้ ซึ่งอาจเป็นจำนวนเดือนหรือปี หรืออาจเป็นการจ้างงานเป็นระยะเวลาไม่กำหนด
เงื่อนไขการจ้าง: ระบุเงื่อนไขและข้อตกลงที่เกี่ยวข้องกับการจ้างงาน เช่น เงื่อนไขการเลิกจ้าง, การชดเชย, การบริการที่จะให้แก่ลูกจ้าง เป็นต้น
เงินเดือนและสวัสดิการ: ระบุจำนวนเงินที่ลูกจ้างจะได้รับในแต่ละระยะเวลา, รวมถึงสวัสดิการอื่น ๆ ที่อาจมีให้ตามเงื่อนไขของสัญญา
ข้อตกลงเพิ่มเติม: อาจรวมถึงข้อตกลงอื่น ๆ ที่เกี่ยวข้องกับการจ้างงาน เช่น ความลับและความเป็นส่วนตัว, ข้อตกลงเกี่ยวกับทรัพย์สินทางปัญญา, เป็นต้น
เอกสารสัญญาจ้างเป็นเอกสารที่สำคัญที่ช่วยให้ทั้งลูกจ้างและนายจ้างเข้าใจข้อกำหนด และเงื่อนไขที่เกี่ยวข้องกับการทำงานและการจ้างงานได้อย่างชัดเจนและเป็นทางการ */}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlinePaperClip />
            <span>จัดการเอกสาร</span>
            {/* กำหนดการที่ระบุเวลาทำงานและกิจกรรมต่าง ๆ ที่เกี่ยวข้องกับการทำงานในองค์กรหรือธุรกิจ ซึ่งมักใช้เพื่อวางแผนและการจัดการทรัพยากรมนุษย์ในองค์กรช่วยให้ทุกคนในองค์กรเข้าใจและปฏิบัติตามกำหนดการทำงาน, ลดความสับสนและช่วยในการวางแผนงานอย่างมีประสิทธิภาพ */}
            {/* จัดการโควต้าการลา
การจัดการวันหยุดพิเศษหรือ "Holiday Management" คือกระบวนการหรือกิจกรรมที่องค์กรหรือธุรกิจดำเนินการเพื่อจัดการและบริหารจัดการกับวันหยุดพิเศษที่กำหนดไว้ โดยทั่วไป, วันหยุดพิเศษคือวันที่ไม่ทำงานปกติ, ซึ่งมักจะเป็นวันสำคัญทางศาสนา, วัฒนธรรม, หรือเทศกาลที่มีความสำคัญในสังคม */}
            {/* จัดการวันหยุดพิเศษ
จัดการวันหยุดพิเศษ ใช้กรณีที่พนักงานทำโอที ซึ่งไม่ได้รับค่าแรงในวันนั้นๆ แต่ต้องการสะสมชั่วโมงที่ทำโอที มาใช้เป็นวันหยุดพิเศษ หรือวันลางานแทน ทั้งนี้จะขึ้นอยู่กับเงื่อนไขในการสะสมชั่วโมงโอทีเพิ่มเติม */}
            {/* ตั้งค่าลายเซ็น
การตั้งค่าลายเซ็นอิเล็กทรอนิกมีประโยชน์ในการลดการใช้กระดาษ, เพิ่มความสะดวกสบาย, และลดเวลาในการดำเนินการทางธุรกิจ. นอกจากนี้, ลายเซ็นดิจิทัลมีความปลอดภัยสูงกว่าลายเซ็นที่ทำด้วยกระดาษ, เนื่องจากมักมีการใช้เทคโนโลยีการรับรองตัวตนเพิ่มเติม */}
          </StyledNavLink>
        </li>
      </NavList>
      <DividerWithText>Salary calculation</DividerWithText>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineCalculator />
            <span>การคำนวณ</span>
            {/* คำนวณเงินเดือน
การคำนวณเงินเดือนมีความสำคัญในการบริหารจัดการทรัพยากรมนุษ ย์และการเงินในองค์กร เพื่อให้มั่นใจว่าการจ่ายเงินเดือนของพนักงานเป็นไปตามขั้นตอน และมีความถูกต้อง เพื่อตรวจสอบหรือประเมินจำนวนเงินที่พนักงานจะได้รับในแต่ละรอบการจ่ายเงินเดือน การคำนวณเงินเดือนมักจะคำนวณจากองค์ประกอบหลักๆ ดังนี้

อัตราค่าจ้าง: ระบุจำนวนเงินที่พนักงานจะได้รับต่อหนึ่งหนึ่งระหว่างการทำงาน อัตราค่าจ้างสามารถเป็นค่าคงที่หรือค่าที่เปลี่ยนแปลงได้ตามเงื่อนไขของการจ้างงานและสิทธิประโยชน์ที่ได้รับ
เวลาการทำงาน: กำหนดระยะเวลาที่พนักงานทำงานในรอบหนึ่ง เช่น ชั่วโมง, วัน, หรือเดือน
หักเงินหรือการเพิ่มเงิน: คำนวณหักเงินหรือการเพิ่มเงินที่มีผลต่อจำนวนเงินที่พนักงานจะได้รับ โดยการหักเงินอาจเป็นค่าธรรมเนียม, ภาษี, ค่าประกันสุขภาพ, หรือการเบิกเงินสะสม
รายได้สุทธิ: คำนวณรายได้สุทธิโดยลบจำนวนเงินที่ถูกหักออกจากอัตราค่าจ้าง หรือเพิ่มเข้ามาจากการเพิ่มเงิน จากจำนวนเงินที่พนักงานจะได้รับตามคำนวณ */}
            {/* คำนวณงวดโอที
การคำนวณในส่วนของโอที แยกออกมาจากการคำนวณเงินเดือนในงวดปกติ สามารถกำหนดวันที่จะคิดโอทีได้ว่าต้องการให้เริ่มคำนวณตั้งแต่วันที่เท่าไร ซึ่งจะเป็นการแยกออกจากการคำนวณงวดปกติ */}
            {/* คำนวณงวดแยกเวลา
การคำนวณเวลา ขาดงาน ลา และสายแยกออกจากการคำนวณเงินเดือนงวดปกติ และสามารถที่จะเลือกได้ว่าต้องการที่ทำการจ่ายพร้อมเงินเดือนงวกปกติหรือไม่ หรือต้องการคำนวณและจ่ายแยกกับเงินเดือนก็สามารถที่จะทำได้ */}
            {/* คำนวณงวดพิเศษ
การจ่ายเงินงวดพิเศษ นอกการจ่ายเงินเดือนรอบปกติ เช่น โบนัส ค่าคอมมิสชั่น เงินได้อื่น ๆ เป็นต้น คำนวณงวดพิเศษ สามารถกำหนดวันที่จ่าย ดาวน์โหลรายงาน Slip งวดพิเศษ และรายงานสรุปเงินที่ต้องจ่าย ทั้งไฟล์ Excel และ ไฟล์ Text จะสามารถโหลดรายงานสรุปเงินที่ต้องจ่าย ได้ต่อเมื่อ กด Finish งวดพิเศษแล้ว หากกด Finish ไปแล้วแต่ต้องการแก้ไขข้อมูล สามารถ กด Unfinish เพื่อกลับไปแก้ไขได้ แต่หากรอบการคำนวณเงินเดือน เดือนนั้นๆ ถูกปิดงวดบัญชีไปแล้ว จะไม่สามารถกด แก้ไข ได้อีก */}
            {/* คำนวณภาษี ประกันสังคม กยศ.
การคำนวณภาษีที่ต้องเสีย พร้อมแสดงรายการหัก ค่าลดหย่อนต่าง ๆ ทั้งส่วนของลูกจ้างและนายจ้างมีการจำกัดขอบเขตทางรายได้, ซึ่งอัตราและขอบเขตนี้อาจมีการปรับเปลี่ยนตามนโยบายทางภาครัฐ และสามารถตรวจสอบข้อมูลล่าสุดได้จากสำนักงานประกันสังคมหรือหน่วยงานที่เกี่ยวข้อง */}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineCloudArrowDown />
            <span>การบันทึกข้อมูล</span>
            {/* บันทึกรายรับ-รายจ่าย
รายการรายรับรายจ่ายที่ใช้สำหรับการเพิ่ม รายรับ และ รายจ่าย ที่เป็น Incomeและ Expense ของพนักงานทั้งองค์กรโดย

รายรับ คือ จำนวนเงินนำไปรวมกับเงินเดือน
รายจ่าย คือ จำนวนเงินนำไปหักกับเงินเดือน */}
            {/* บันทึกเบิกล่วงหน้า
กระบวนการที่พนักงานขอเบิกส่วนหนึ่ง หรือทั้งหมดของเงินเดือนของตนก่อนวันที่เงินเดือนจริงจะถูกจ่ายตามปกติตามกำหนด การเบิกเงินเดือนล่วงหน้ามักเป็นเรื่องที่ได้รับความสนใจเนื่องจากสามารถช่วยให้พนักงานมีเงินใช้ได้ก่อนวันที่ได้รับเงินเดือนจริงๆ และอาจช่วยในการจัดการกับสถานการณ์ฉุกเฉิน หรือความจำเป็นที่เร่งด่วนที่ต้องการเงิน ในบางกรณีอาจมีข้อได้เปรียบสำหรับพนักงานในบางสถานการณ์ แต่ก็ควรพิจารณาคำนึงถึงข้อจำกัดและเงื่อนไขที่เกี่ยวข้องก่อนดำเนินการใดๆ */}
            {/* นำส่งข้อมูลเงินเดือน
การส่งข้อมูลเกี่ยวกับเงินเดือนของพนักงานไปยังสถานะ และหน่วยงานที่เกี่ยวข้องภายในบริษัทหรือองค์กร โดยทั่วไปแล้ว กระบวนการนี้จะมีเป้าหมายเพื่อให้ข้อมูลเงินเดือนถูกต้องและสมบูรณ์ เพื่อให้สามารถใช้ข้อมูลนั้นในการปฏิบัติตามกฎหมาย, การบัญชี, การจัดการทรัพยากรมนุษย์, และการวิเคราะห์ภาพรวมของการจ่ายเงินเดือนในองค์กร */}
            {/* ดาวน์โหลดไฟล์ข้อมูลเงินเดือน
การดาวน์โหลดไฟล์ที่มีข้อมูลเกี่ยวกับเงินเดือนของพนักงาน ซึ่งไฟล์นี้ส่วนมากจะเป็นไฟล์ Excel, CSV, หรือไฟล์ข้อมูลอื่น ๆ ที่มีข้อมูลทางการเงินเกี่ยวกับการจ่ายเงินเดือนของพนักงาน ข้อมูลที่อาจรวมอยู่ในไฟล์นี้ทั้งหมดการดาวน์โหลดไฟล์ข้อมูลเงินเดือน เป็นวิธีที่สะดวกในการจัดเก็บข้อมูลและการวิเคราะห์ เพื่อการบริหารจัดการทรัพยากรมนุษย์และการเงินในองค์กร */}
            {/* การกำหนดวันที่และยอดเงินที่จะปรับให้กับพนักงาน โดยสามารถเลือกช่วงปรับได้ การปรับล่วงหน้า, การปรับระหว่างเดือน และปรับทันที สามารถกำหนดวันที่มีผลด้วยตนเองได้เลย
โดยสามารถทำการปรับเงินเดือนจากในระบบได้เลย กรณีมีการปรับเงินเดือนพนักงานรายบุคคล และ ดาวน์โหลดไฟล์เทมเพลทเพื่อทำการนำเข้ากรณีพนักงานหลายท่านได้ โดยการปรับเงินเดือนดังกล่าว จะสามารถเก็บประวัติ แล้วกลับมาตรวจสอบได้ว่าในแต่ละรอบเดือน มีการปรับเงินเดือนให้กับพนักงานไปแล้วกี่คน และมีการปรับเงินเดือนเมื่อวันที่เท่าไหร่
กรณีปรับเงินเดือน ลูกค้าต้องทำการตั้งค่า จำนวนวันทำงาน ที่จะเป็นตัวหารของ ค่าเเรงต่อวันของพนักงานก่อน */}
            {/* จัดการภาระหนี้สินพนักงาน
กระบวนการหรือกิจกรรมที่บริษัทหรือองค์กร ซึ่งอาจเกิดจากสินเชื่อผ่อนชำระ, การกู้ยืมเงิน, หรือสิทธิประโยชน์อื่น ๆ ที่พนักงานได้รับจากองค์กร การจัดทำนโยบายและข้อบังคับที่ส่งเสริมความรับผิดชอบในการบริหารจัดการภาระหนี้สินในองค์กรจ และส่งเสริมพฤติกรรมการบริหารจัดการที่รับผิดชอบต่อการใช้เงิน และการผ่อนชำระหนี้ในพนักงาน */}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineGift />
            <span>สวัสดิการพนักงาน</span>
          </StyledNavLink>
        </li>
      </NavList>
      <DividerWithText>Learning & Development</DividerWithText>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineBriefcase />
            <span>การเรียนรู้เพิ่มเติม</span>
            {/* E-Library
การสร้างหมวดหมู่ คือ การจัดกลุ่มเนื้อหา หรือ ประเภทเนื้อหา ที่ต้องการให้อยู่ในหมวดหมู่เดียวกันเพื่อง่ายต่อการค้นหา และเมื่อมีการเพิ่มเนื้อหาแล้ว ผู้ใช้งานสามารถนำเนื้อหาจาก E-library ไปเพิ่มเป็น คอร์สเรียนให้กับพนักงานได้ ในเมนู E-Learning */}

            {/* E-Learning
การสร้างหลักสูตรการเรียนรู้สำหรับพนักงาน โดยจะนำเนื้อหาจาก E-library มาเพิ่มในคอร์สนั้น โดยในคอร์สจะสามารถเพิ่มได้ทั้งบทเรียน และ บททดสอบ */}

            {/* ฝึกอบรม
เป็นการสร้าง การฝึกอบรม ว่า จะมีการฝึกอบรมเรื่องอะไร วันที่เริ่ม-วันที่จบ ใช้เวลาในการฝึกอบรมวันละกี่ชั่วโมง ราคาต่อตัว ที่ให้พนักงานคนละเท่าไร และสามารถเลือกได้ว่าการฝึกอบรมครั้งนี้ มีพนักงานคนไหนในองค์กรอบรมบ้าง เป็นต้น */}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineClipboardDocumentCheck />
            <span>การประเมินผล</span>
            {/* เป็นการสร้างแบบประเมินให้กับพนักงาน ทั้งการประเมินพนักงานทั่วไป และการประเมินพนักงานทดลองงาน โดยประเภทคำตอบของแบบประเมิน ทางระบบมีให้เลือกถึง 4 รูปแบบ ดังนี้

หลายตัวเลือก
หลายคำตอบ
คำตอบสั้น ๆ
ย่อหน้า
ความหมายของประเภทคำตอบแต่ละรูปแบบหลายตัวเลือก คือ การกำหนดคำตอบหลายตัวเลือก โดยแต่ละตัวเลือกสามารถกำหนดคะแนนเฉลี่ยในแต่ละข้อได้ ที่เกินกว่าคะแนนในข้อนั้น ๆ ได้ */}

            {/* รอบการประเมิน
ขั้นตอนหรือช่วงเวลาที่ใช้ในการประเมินผลงาน ประสิทธิภาพ หรือคุณลักษณะต่าง ๆ ของบุคคล โครงการ หรือองค์กร โดยทั่วไปแล้วรอบการประเมินจะถูกกำหนดโดยตามนโยบายหรือแผนงานขององค์กร และอาจมีการกำหนดเป็นรอบประจำ เช่น รายปี รายความสำเร็จ หรือรายโครงการ โดยการประเมินอาจมีการใช้วิธีการต่าง ๆ เช่น การสำรวจความคิดเห็น การตรวจสอบเอกสาร หรือการสัมภาษณ์ผู้เกี่ยวข้อง เพื่อให้ได้ข้อมูลและข้อเสนอแนะเพื่อพัฒนาและปรับปรุงต่อไป */}

            {/* ตัวชี้วัดภายนอก
ตัวชี้วัดที่ใช้วัดประสิทธิภาพ ความสำเร็จ หรือผลลัพธ์ขององค์กร โครงการ หรือกิจกรรมต่าง ๆ จากมุมมองภายนอก ซึ่งอาจเป็นมาตรฐาน กฎหมาย หรือค่าเฉลี่ยที่ถูกยอมรับในวงกว้าง การใช้ตัวชี้วัดภายนอกช่วยให้องค์กรสามารถวัดและประเมินผลการดำเนินงานของตนเองได้อย่างมีประสิทธิภาพและเปรียบเทียบกับองค์กรอื่น ๆ ในอุตสาหกรรมหรือสภาพแวดล้อมที่คล้ายกัน */}

            {/* KPI Profile
ข้ออมูลที่ระบุตัวชี้วัดสำคัญ (Key Performance Indicators - KPIs) ที่ใช้ในการวัดและติดตามประสิทธิภาพหรือผลลัพธ์ของบุคคล ทีมงาน หรือองค์กร โดยทั่วไป KPI Profile จะรวมถึงข้อมูลต่าง ๆ เกี่ยวกับตัวชี้วัด เช่น: KPI Profile เป็นเครื่องมือที่มีประโยชน์ในการจัดการและปรับปรุงประสิทธิภาพของบุคคล ทีมงาน หรือองค์กรโดยทั่วไปโดยการให้ข้อมูลที่ชัดเจนและเป็นประโยชน์ในการตัดสินใจและวางแผนการดำเนินงานต่อไป

ชื่อของ KPI: ระบุชื่อหรือคำอธิบายสั้นๆ เกี่ยวกับตัวชี้วัด
คำอธิบาย: อธิบายรายละเอียดเกี่ยวกับ KPI เพื่อให้เข้าใจมากขึ้น
วัตถุประสงค์: ระบุวัตถุประสงค์หรือเหตุผลที่ต้องการวัดด้วย KPI นั้นๆ
หน่วยของการวัด: ระบุหน่วยที่ใช้ในการวัด KPI เช่น เปอร์เซ็นต์, จำนวน, เงิน
เกณฑ์การวัด: ระบุวิธีการวัดหรือเกณฑ์ที่ใช้ในการประเมิน KPI ว่าความสำเร็จมีขั้นต่ำอย่างไร หรือมีการใช้เกณฑ์การวัดอะไรบ้าง
เป้าหมาย: ระบุเป้าหมายหรือระดับที่ต้องการให้ KPI นั้นๆ ถึงได้
ผู้รับผิดชอบ: ระบุบุคคลหรือทีมที่รับผิดชอบในการติดตามและปรับปรุงผลลัพธ์ของ KPI
ช่วงเวลา: ระบุช่วงเวลาหรือระยะเวลาที่ใช้ในการวัดและติดตาม KPI นั้นๆ
KPI Profile เป็นเครื่องมือที่มีประโยชน์ในการจัดการและปรับปรุงประสิทธิภาพของบุคคล ทีมงาน หรือองค์กรโดยทั่วไปโดยการให้ข้อมูลที่ชัดเจนและเป็นประโยชน์ในการตัดสินใจและวางแผนการดำเนินงานต่อไป */}

            {/* จดหมายเตือน
เป็นเอกสารทางการที่ส่งถึงพนักงานจากนายจ้างหรือผู้บริหาร เพื่อแจ้งเตือนหรือสื่อสารเกี่ยวกับเรื่องใดเรื่องหนึ่งที่เกี่ยวข้องกับการทำงาน อาจเป็นการแจ้งเตือนเรื่องการปฏิบัติตามนโยบายของบริษัท เตือนเรื่องการปรับปรุงเงื่อนไขการทำงาน หรือแจ้งเตือนเรื่องการประเมินประสิทธิภาพหรือสื่อสารเกี่ยวกับการพัฒนาและการส่งเสริมสุขภาพที่ดีในที่ทำงาน เนื้อหาของจดหมายเตือนพนักงานจะต้องเป็นไปตามนโยบายและข้อบังคับขององค์กรอย่างเคร่งครัดและชัดเจน เพื่อให้พนักงานทราบถึงข้อความ และปฏิบัติตามตามที่กำหนดไว้ในจดหมายนั้นๆ อย่างเคร่งครัด */}
          </StyledNavLink>
        </li>
      </NavList>
      <DividerWithText>Help</DividerWithText>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineLink />
            <span>แลกเปลี่ยนข้อมูล</span>
            {/* HR สามารถประกาศข่าวสารต่าง ๆ ให้กับพนักงานทั้งองค์กรทราบได้อย่างสะดวก โดยแสดงผลบน 3 ช่องทาง คือ

- Mobile Application
- Line OA
- Website

ซึ่งการเพิ่มประกาศข่าวสารนั้น สามารถแนบได้ทั้งไฟล์รูปภาพ คลิปวิดิโอ และไฟล์อื่น ๆ และพนักงานสามารถกด"รับทราบ" เพื่อแจ้งผลการรับทราบข้อมูลให้กับ HR */}

            {/* News Feed
เป็นข้อมูลหรือกิจกรรมสำคัญที่รวบรวมให้กับ HR ผู้บริหาร หรือพนักงานได้ทราบข้อมูล โดยแสดงอยู่ที่หน้าแรกของ Website หรือ Application เช่น ข้อมูลการยื่นเอกสารต่าง ๆ จดหมายเตือน ประกาศข่าวสาร Todo-List หรือแม้กระทั่งข้อมูลวันเกิดในเดือนนั้น

ซึ่งข้อมูลที่แสดงนั้น HR หรือพนักงานสามารถกดอนุมัติ ไม่อนุมัติ ตรวจสอบ รับทราบ หรืออ่านรายละเอียดเพิ่มเติมจากหน้า News Feed นี้ได้ทันที */}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineCubeTransparent />
            <span>ช่วยวางแผนงาน</span>
            {/* Todo-Lists
รายการของงานหรือกิจกรรมที่ควรทำหรือต้องทำในขณะหนึ่ง โดยมักจะเป็นรายการที่เขียนลงบนกระดานหรือแอพพลิเคชันเพื่อช่วยในการจัดการเวลาและงานที่ต้องทำของบุคคล การใช้ todo-lists เป็นเครื่องมือที่มีประสิทธิภาพในการจัดการเวลาและงานให้เป็นระเบียบ เพื่อให้ผู้ใช้สามารถติดตามและดำเนินงานได้อย่างมีประสิทธิภาพมากขึ้น*/}
          </StyledNavLink>
        </li>
      </NavList>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineExclamationTriangle />
            <span>PHQ-9</span>
          </StyledNavLink>
        </li>
      </NavList>
      <DividerWithText>AI and Insight</DividerWithText>
      <NavList>
        <li>
          <StyledNavLink to="">
            <HiOutlineSparkles />
            <span>ระบบจัดการอัตโนมัติ</span>
            {/* ตั้งค่าเวลารันคำสั่ง
การตั้งค่ารันคำสั่ง ใช้สำหรับเป็นการแจ้งเตือนใน HumanSoft Notify ให้มีการส่งสรุปผลรายการต่าง ๆ เช่น สรุปเวลาการทำงานประจำวันส่งเข้า HumanSoft Notify เป็นต้นซึ่งเมื่อถึงเวลาที่มีการกำหนดให้ระบบรันคำสั่ง ระบบจะดึงข้อมูลทั้งหมด ตามเงื่อนไขที่เลือก มาสรุปผลลงในกลุ่ม เช่น เลือกสรุปพนักงานขาดงานประจำวันส่งเข้า HumanSoft Notify ให้รันคำสั่งเวลา10:00 น. ในทุก ๆ วัน ระบบจะแสดงข้อมูลของพนักงานตั้งแต่เวลา 00:00 – 10:00 น. มาให้ ว่ามีพนักงานคนไหนขาดงานบ้าง และนำข้อมูลส่วนนี้ทำการแจ้งเตือนที่ HumanSoft Notify ที่มีการกำหนดไว้ */}

            {/* ตั้งค่า HumanSoft Notify
การตั้งค่า HumanSoft Notify ใช้สำหรับสร้างกลุ่มที่จะรับการแจ้งเตือนการลงเวลาของพนักงาน หรือสรุปการลงเวลาการทำงาน เพื่อทราบข้อมูลกรลงเวลาในแต่ละวัน ให้ง่ายต่อการตรวจสอบจำนวนพนักงานที่ต้องการ หรือแจ้งเตือนวันเกิด โดยการตั้งค่า HumanSoft Notify */}

            {/* ตั้งค่าค่าแนะนำ
เมนูคำแนะนำ เป็นเมนูสำหรับการแจ้งเตือนผ่านแอปพลิเคชันของพนักงาน กรณีที่พนักงานมีการลงเวลาผิดพลาด หรือ ลืมลงเวลา รวมถึงการลงเวลาที่เกินกะการทำงานของตนเอง ระบบจะแจ้งเตือนให้พนักงานขอเอกสารโอที เพื่อไม่ให้เสียผลประโยชน์ของตัวพนักงานเอง อีกทั้งทาง HR ยังสามารถตรวจสอบเวลาที่ผิดพลาดของพนักงานผ่านหน้าเว็บเบาว์เซอร์ที่หน้าเมนูคำนวณเงินเดือน เพื่อตรวจสอบเวลาผิดพลาด และแจ้งกับทางพนักงาน เพื่อให้การคำนวณเงินเดือนไม่ผิดพลาดได้ด้วยเช่นกัน */}
          </StyledNavLink>
        </li>
      </NavList>
      <DividerWithText>General</DividerWithText>
      <NavList>
        <li>
          <StyledNavLink to="settings">
            <HiOutlineCog8Tooth />
            <span>การตั้งค่า</span>
            {/* ตั้งค่าทั่วไป
เป็นการตั้งค่าทั่วไปของทั้งองค์กร มีการตั้งค่า ดังนี้

ตั้งค่าหลักคิดการคำนวณเงินเดือน
ตั้งค่าการลงเวลาการทำงาน
ตั้งค่าประกันสังคม
ตั้งค่าการแจ้งเตือน
ตั้งค่าแบบฟอร์ม */}
            {/* ตั้งค่าเวลาการทํางาน
เมนูตั้งค่าเวลาการทำงาน คือ การตั้งค่าเงื่อนไขพิเศษ เช่น มาเช้า สาย พักเกิน พักไว กลับก่อน กลับช้า โอที เมื่อกดคลิกแก้ไขก็จะสามารถตั้งค่าเงื่อนไขต่าง ๆ ได้ตามต้องการ*/}
            {/*  ตั้งค่าประเภทการลา 20 ประเภท
เมนูประเภทการลา จะเป็นการตั้งค่าประเภทการลาขององค์กร ว่ามีการลาแบบใดบ้าง และสามารถเพิ่มได้มากถึง 20 ประเภท*/}

            {/* ตั้งค่าประเภทรายรับ-รายจ่าย
การตั้งค่าประเภทรายรับรายจ่าย จะเป็นการตั้งค่านำรายการรายรับ - รายจ่าย มาใช้งานตามเงื่อนไขที่มีการตั้งค่าไว้ และสามารถเลือกตั้งค่าการใช้งานแต่ละประเภทได้ เช่น

รูปแบบการคำนวณ Income จะเป็นการตั้งค่ารายรับประจำเดือนของพนักงานที่ไม่ได้เป็นรายได้ประจำ บางเดือนได้รับบางเดือนไม่ได้รับ

รูปแบบการคำนวณ Expense จะเป็นการตั้งค่ารายหักของพนักงาน ที่ไม่ได้เป็นรายหักประจำบางเดือนถูกหักบางเดือนไม่ถูกหัก รายการรายรับ - รายจ่าย

รูปแบบการคำนวณ Constant จะเป็นการตั้งค่า รายหักหรือรายรับของพนักงานที่ได้รับหรือถูกหักเป็นประจำเท่า ๆ กันทุกเดือน

รูปแบบการคำนวณ Loan จะเป็นการตั้งค่ารายหักของพนักงานที่มีการแบ่งการหักออกเป็นงวด ๆ โดยมีระยะเริ่มต้นและสิ้นสุดแน่นนอน ซึ่งอาจจะมีดอกเบี้ยหรือไม่มีดอกเบี้ยก็ได้

รูปแบบการคำนวณ Fund จะเป็นการตั้งค่ารายหักของพนักงานที่ถูกหัก และนำไปเก็บสะสมไว้ในกองทุนต่าง ๆ อาจจะเป็นส่วนที่บริษัทหักพนักงานอย่างเดียว หรืออาจจะมีส่วนที่บริษัทสมทบให้พนักงานด้วย

รูปแบบการคำนวณ Welfare จะเป็นการตั้งค่ารายรับสวัสดิการประจำปีของพนักงาน ที่ไม่ได้เป็นรายได้ประจำบางเดือนได้รับ บางเดือนไม่ได้รับ

รูปแบบการคำนวณ Auto จะเป็นการตั้งค่า รายรับหรือรายหักที่มีหลักเกณฑ์ในการคำนวณเฉพาะบุคคล */}
            {/* ตั้งค่ากลุ่ม ประเภทรายรับ-รายจ่าย
กลุ่มประเภทรายรับรายจ่าย คือ เมนูสำหรับการเพิ่ม แก้ไขประเภทรายรับ รายจ่าย เช่น การตั้งค่าประกันสังคม เป็นประเภทรายจ่าย */}
            {/* ตั้งค่าเงื่อนไขตัวช่วยอัจริยะ
เมนูตั้งค่าคำแนะนำ คือ คำแนะนำแจ้งเตือนผ่าน Application กรณีพนักงาน ลงเวลาการทำงานผิดพลาด และลดภาระงานของ HR

วันทำงาน ไม่มาทำงาน
ลงเวลาไม่ครบคู่
ชั่วโมงการทำงานขาดมากกว่า 1 ชั่วโมง
เข้างานก่อนมากกว่าครึ่งชั่วโมง
ออกงานหลังมากกว่าครึ่งชั่วโมง
มาทำงานในวันหยุด */}
          </StyledNavLink>
        </li>
      </NavList>
    </nav>
  );
}

export default MainNav;
