const question = [
  {
    id: 1,
    text: "เบื่อ ทำอะไร ๆ ก็ไม่เพลิดเพลิน",
  },
  {
    id: 2,
    text: "ไม่สบายใจ ซึมเศร้า หรือท้อแท้",
  },
  {
    id: 3,
    text: "หลับยาก หรือหลับ ๆ ตื่น ๆ หรือหลับมากไป",
  },
  {
    id: 4,
    text: "เหนื่อยง่าย หรือไม่ค่อยมีแรง",
  },
  {
    id: 5,
    text: "เบื่ออาหาร หรือกินมากเกินไป",
  },
  {
    id: 6,
    text: "รู้สึกไม่ดีกับตัวเอง คิดว่าตัวเองล้มเหลว หรือเป็นคนทำให้ตัวเอง หรือครอบครัวผิดหวัง",
  },
  {
    id: 7,
    text: "สมาธิไม่ดีเวลาทำอะไร เช่น ดูโทรทัศน์ ฟังวิทยุ หรือทำงานท่ีต้องใช้ความตั้งใจ",
  },
  {
    id: 8,
    text: "พูดหรือทำอะไรช้าจนคนอื่นมองเห็น หรือกระสับกระส่ายจนท่านอยู่ไม่นิ่งเหมือนเคย",
  },
  {
    id: 9,
    text: "คิดทำร้ายตนเอง หรือคิดว่าถ้าตาย ๆ ไปเสียคงจะดี",
  },
];

export default question;
